---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType
source: html/7f7c9a7c-c18e-5882-1e8b-6a60653b2b79.htm
---
# StructuralConnectionHandlerType Members

Modifies StructuralConnectionHandlerType of input StructuralConnectionHandler by adding representors of input elements or subelements.